'use strict'
// 是否为自定义文字字数，是则文本框显示，否则隐藏
function isCustomerizedTextSize() {
    var textSizeOpts = document.getElementsByClassName("input-box");
    var customerizedOpt = document.getElementsByClassName("customerized-text-size")[0];
    var inputBox = document.getElementsByClassName("customerized-text-size-input-box")[0];
    for (let i = 0; i < textSizeOpts.length; i++) {
        bindEventWithSafty("click", textSizeOpts[i], function () {
            if (customerizedOpt.checked) {
                inputBox.style.display = "inline";
            } else {
                inputBox.style.display = "none";
            }
        });
    }

}

// 得到0~(size-1)的随机整数
function getRadomNumber(size) {
    return Math.floor(Math.random() * size);
}


/* add click event */
function bindEventWithSafty(e, obj, func) {
    // firefox等
    if (obj.addEventListener) {
        obj.addEventListener(e, func, false);
    }
    // IE8 等
    if (obj.attachEvent) {
        obj.attachEvent("on" + e, func);
    }
}


/* 得到产生随机文本的重要参数 */
function getRadomTextParameters() {

    // 得到文本类型radomTextType
    var textTypeOpts = document.getElementsByClassName("radom-text-type");
    var textType = "";
    for (let i = 0; i < textTypeOpts.length; i++) {
        if (textTypeOpts[i].checked) {
            textType = textTypeOpts[i].getAttribute("value");
        }
    }
    //console.log(textType);

    // 得到文本风格
    var textStyleOpts = document.getElementsByClassName("radom-text-style");
    var textStyle = "";
    for (let i = 0; i < textStyleOpts.length; i++) {
        if (textStyleOpts[i].checked) {
            textStyle = textStyleOpts[i].getAttribute("value");
        }
    }
    //console.log(textStyle);

    // 得到文本容量
    var textSizeOpts = document.getElementsByClassName("radom-text-size");
    var textSize = "";
    for (let i = 0; i < textSizeOpts.length; i++) {
        if (textSizeOpts[i].checked) {
            textSize = textSizeOpts[i].getAttribute("value");
        }
    }
    if (textSize === "-1") {
        textSize = document.getElementsByClassName("customerized-text-size-input-box")[0].value;
    }
    //console.log(textSize);
    showCharacters(textType, textStyle, textSize);
}

function showCharacters(textType, textStyle, textSize) {
    // 初始化中文字符和标点
    var simplifiedChineseCharacterDB = "的一是在了不和有大这主中人上为们地个用工时要动国产以我到他会作来分生对于学下级就年阶义发成部民可出能方进同行面说种过命度革而多子后自社加小机也经力线本电高量长党得实家定深法表着水理化争现所二起政三好十战无农使性前等反体合斗路图把结第里正新开论之物从当两些还天资事队批如应形想制心样干都向变关点育重其思与间内去因件日利相由压员气业代全组数果期导平各基或月毛然问比展那它最及外没看治提五解系林者米群头意只明四道马认次文通但条较克又公孔领军流入接席位情运器并飞原油放立题质指建区验活众很教决特此常石强极土少已根共直团统式转别造切九你取西持总料连任志观调七么山程百报更见必真保热委手改管处己将修支识病象几先老光专什六型具示复安带每东增则完风回南广劳轮科北打积车计给节做务被整联步类集号列温装即毫知轴研单色坚据速防史拉世设达尔场织历花受求传口断况采精金界品判参层止边清至万确究书术状厂须离再目海交权且儿青才证低越际八试规斯近注办布门铁需走议县兵固除般引齿千胜细影济白格效置推空配刀叶率述今选养德话查差半敌始片施响收华觉备名红续均药标记难存测士身紧液派准斤角降维板许破述技消底床田势端感往神便贺村构照容非搞亚磨族火段算适讲按值美态黄易彪服早班麦削信排台声该击素张密害侯草何树肥继右属市严径螺检左页抗苏显苦英快称坏移约巴材省黑武培著河帝仅针怎植京助升王眼她抓含苗副杂普谈围食射源例致酸旧却充足短划剂宣环落首尺波承粉践府鱼随考刻靠够满夫失包住促枝局菌杆周护岩师举曲春元超负砂封换太模贫减阳扬江析亩木言球朝医校古呢稻宋听唯输滑站另卫字鼓刚写刘微略范供阿块某功套友限项余倒卷创律雨让骨远帮初皮播优占死毒圈伟季训控激找叫云互跟裂粮粒母练塞钢顶策双留误础吸阻故寸盾晚丝女散焊功株亲院冷彻弹错散商视艺灭版烈零室轻血倍缺厘泵察绝富城冲喷壤简否柱李望盘磁雄似困巩益洲脱投送奴侧润盖挥距触星松送获兴独官混纪依未突架宽冬章湿偏纹吃执阀矿寨责熟稳夺硬价努翻奇甲预职评读背协损棉侵灰虽矛厚罗泥辟告卵箱掌氧恩爱停曾溶营终纲孟钱待尽俄缩沙退陈讨奋械载胞幼哪剥迫旋征槽倒握担仍呀鲜吧卡粗介钻逐弱脚怕盐末阴丰编印蜂急拿扩伤飞露核缘游振操央伍域甚迅辉异序免纸夜乡久隶缸夹念兰映沟乙吗儒杀汽磷艰晶插埃燃欢铁补咱芽永瓦倾阵碳演威附牙芽永瓦斜灌欧献顺猪洋腐请透司危括脉宜笑若尾束壮暴企菜穗楚汉愈绿拖牛份染既秋遍锻玉夏疗尖殖井费州访吹荣铜沿替滚客召旱悟刺脑措贯藏敢令隙炉壳硫煤迎铸粘探临薄旬善福纵择礼愿伏残雷延烟句纯渐耕跑泽慢栽鲁赤繁境潮横掉锥希池败船假亮谓托伙哲怀割摆贡呈劲财仪沉炼麻罪祖息车穿货销齐鼠抽画饲龙库守筑房歌寒喜哥洗蚀废纳腹乎录镜妇恶脂庄擦险赞钟摇典柄辩竹谷卖乱虚桥奥伯赶垂途额壁网截野遗静谋弄挂课镇妄盛耐援扎虑键归符庆聚绕摩忙舞遇索顾胶羊湖钉仁音迹碎伸灯避泛亡答勇频皇柳哈揭甘诺概宪浓岛袭谁洪谢炮浇斑讯懂灵蛋闭孩释乳巨徒私银伊景坦累匀霉杜乐勒隔弯绩招绍胡呼痛峰零柴簧午跳居尚丁秦稍追梁折耗碱殊岗挖氏刃剧堆赫荷胸衡勤膜篇登驻案刊秧缓凸役剪川雪链渔啦脸户洛孢勃盟买杨宗焦赛旗滤硅炭股坐蒸凝竟陷枪黎救冒暗洞犯筒您宋弧爆谬涂味津臂障褐陆啊健尊豆拔莫抵桑坡缝警挑污冰柬嘴啥饭塑寄赵喊垫康遵牧遭幅园腔订香肉弟屋敏恢忘衣孙龄岭骗休借丹渡耳刨虎笔稀昆浪萨茶滴浅拥穴覆伦娘吨浸袖珠雌妈紫戏塔锤震岁貌洁剖牢锋疑霸闪埔猛诉刷狠忽灾闹乔唐漏闻沈熔氯荒茎男凡抢像浆旁玻亦忠唱蒙予纷捕锁尤乘乌智淡允叛畜俘摸锈扫毕璃宝芯爷鉴秘净蒋钙肩腾枯抛轨堂拌爸循诱祝励肯酒绳穷塘燥泡袋朗喂铝软渠颗惯贸粪综墙趋彼届墨碍启逆卸航雾冠丙街莱贝辐肠付吉渗瑞惊顿挤秒悬姆烂森糖圣凹陶词迟蚕亿矩脊歼羽掩汗碰谱童庭蓬贴岸店怪馆挡肢胆君乏傅凌恰吴鸡盆氮铃荡汇狂偶辽宴珊描监涉伏弃仔坯症睛窝跃串瑚饱巢辑迷诗肃谊胎宾顽钠辛阔牲估禁屑秀催炸搬坑暂埋墓腰隆堡迈慌钾魏踏旺蜜兼扭肺兄撒矮拆叉贮抬痕彩冻丛漆详拨瓜奔腿暖脾棒湾旅潜摄朱纤览融拍愚添抱蓄稿翅蛾锐栓签牌瞧疏舍糊驱泉毁伪锯卢函掘扰淬册棱爬豪螟标授朋俗骂仓脏昌邦欺博伐衰寻杠蜗尿幕絮蘖辨孵垄粹填丘歪鬼挺帅斥摘父狗罢炎疆肝酶恨曼蹲币返颠剩港颜酵梯楼绪淮邻御杰恒弗溉淀苯跨肿抑诸凉胚舒胀氢搭醒逃曰竞疾韩尘寿孤督涡甜拒梅乔锡睡昂烯拧扑郊患购蝗锅蔑赖瓶租怒巧膏涌狭醇惕档燕泰胁盘竭违丽氨框舌膨骤蓝幸诚吓秩扶芬咬牵忍椎愤迁仇滩仿绘辈拚喝驳畦番扑葡款敲邀郭妥隐轰籽忆旦犹庸崇庙秆闸厉臣窗纺掠涝涨递葬阅堵扁钳棚鳞伴珍敦椭沃欲鼻宇甫锌皆铲砖贼渣济筛斋梦贪哇萄铺桃蟹挝糙颈雅晒韦耻沸雇储畏霍菲徐榜囊腺茨陕抹屈宿硝昨蔬郝铬茧窄哨辆耀仲薯僚浙饰朴恐腊兽蜡惠犁嘛售鳍敬坝烘颂叔卧纠络玩栏剑苹闯丢柏牺奎嚷宫肾笼郑叙奶芒霞朽妹茬码掀阁卑铰铵弦肤拟署淋梨迪俩撑呵申穆杯姑劝崩劣贺棕裁吐嫩凭曹摧疫鸟镍眉梁禾臭冈陵歧幻丧迭脆怨董镀酷罐逻橡浩撤驶享锦俺佛兔姿铅堤址溃胺皱晨胃氟灿漫泄枢戴孕扣沼逼肌碗巡吊盗蚜钩汤梢挨翼疯鞭扇冶烦悉蔓泼桌柯罩啮勾舰晋扳谴侯倡诊鸣桂奖贾朵霜萌滞蛹阐偿译稼捞棵戈诬撮洒萧奸饮涅衬镗纱瘤葛饼凶饵沾馏钼鞋姓汞枣溜疼凑醛颌肖篡邓撞搅铡卜歇妨挽审凯轧垒箭炕浑龟账趣俭泪泊乃捉窑驾汁凿饿帽湘郎欣慎芳肪蔽绵畅盲缚焕惜仰衍廷玄泻蒲捣妙帕蛇锰棘溪匪绒潘疲纬鸭坎盒拼荫兆熊悲捧锄奉陪玛微钨籍蚊漂糟嘉狼桶拾唉默皂吕馈酯邪孝睛屠畸峡祥蒂拜蝉艾叹淑烤骄篮伞尝吏吞雹勘萎闲佳耙剿鳃砍冯毅骑酚咳煮披佩杏偷摊肚昔韧唇喘吵荆刑拦镁蹄瓷澳塌饥垮滋钝醋捍诡哩宏瞬缔婆扛捷刹猿葱亏阮帆纂喀邵丑郁茂糠俞泳夸砚抖渴聪拱泌藻靶褶扯藤悄逊岘姜砾舆瘦咸焰榴涛垦媳圃胳肆仑叠攀莲债汪棍飘闷蛄蔗贷俊傲哺蝼颁蠢鲤噪膀氛洼栅凤溢炊浦橄陡胰仙柔咂呆姐哭懈兹赋岳楔蜕嵌僵晰挠熙婚缠鬃佣吾辞抚暑遮嚣赴钒嫁磺膛辣谨鄙桩惨杉秸蝇鞘匆娟晃涕萍钛眇趁邮蛮廉熏侦浴俯圭颇赢掏帜枚酮瓣宙谣踩奏竖鞍曝耶茄谐躺榄臼哎抄铆晓虱矢艇坞鞅履恳弥搜肛逸喉苔茁欠叭扔琴芦俱砌拢礁茫筹辱靳枕惩醉挣婶拣嫂荚膊铂昏滨誓夕扮昼艘遥戒逢苍匈慈愁唤蕾帐掺丈瘟顷裕誉祸坛彭橘匹傍淤烷绞豫庞咒芝荀弓罚捏嗨楞仕嘻沫崖瞅帘榨墒捐恕螨汛诞赏琼贩鸿铭嘱隘驰娃瞎遣跌挪耘悦钴魂裸薛鲢躲鳙悠碘沥嘿灶饶酬艳堪淹怠砷吁涤慰缴窜羔趟脖锭兜魔梗炒纽奈硼鼎惑栗谎袁滥亨浊埂垅匝轲遂乒踪俘怔陨噬惧颖茅摔粳垃圾疮厅鄂讥隧睁痰镶哀劈峻尸拐拳眠蔡腋哑契翁肋砧捆哟菊笨垛谦畴膝铍猜殷咽巾赌骚挫钦乓痹嘲渍杭蕉妻壶仆耸蛙廊蛛翠鹰喻扼蕴寇腥瞪籼咕猫况鹏钮搏溅胫萝臀鲫羞罕殿忌亭盅菇旨吻厌宰氰屏桐颚佐栖蒜卓殉搁煌橙窖眨墩躁沛翘蜘酰矫钵哗梭毂嗓禽壕凳筐耦漠屁恭钡驴姚怖滔煽虾哼匠禄稚蚁窃咐茵坊裤勿熬狱熄荐镰柑屯醚耿髓戊腕愉蕨眶煎盈慨晕盼勉虏釉皿瘀昭蝈嗽讽秃谚畔疽冕宵窍峪槐癌敷岂侮携脓卿丸柜碾咀烃怜蝽傻椰逮猎崎淆寺恼胖颊氩盯赠甩坪淘谭莎雏棺躯熹蚧懒踢爵衷仟陋撕缆晾狡庇蓖酿拓簇蚌阎雀鹿卤荸荠搂琢猾苷祛崭硕苞逞炫厄焚铀舵耽爽稠跗邱盏廖韵豹钓奠溴枫犬猖驯侨灼翟擂嘀汹磅嚼狮爹鹅贤颅煞萤烙蛀裹骡痢巷寡碧猴栋嗯柿篷吱厩鳄蕊甸澄闺荧黔嫌瑟玲撇敞葫硷乞蛭阜矾瞒聊琅傀儡啃澜绥豌删龚衔敛厢堕潭舶翔赔夷稗啉僻堰恋萘扒瞄韶笋蚴媒榆廊衅吼锹睦颤刽啬慧碑彝瘠祭侣赚蝶郡叨岔坟疤螬悔譬乖巍疡禹魁掷棋憎阱坠碲卟哄彬绑腑押揉枷菱蹈汰渎愧珩贬衫宅蛴夯吭烫灸竿酱倦镦寮戳睾拴孜迄秤笛羟蜱樟鲍蠕芍诫慕虹厦弊翰锣沪逝诈劫锂咧凋毡蓟椅毯斧绸矣祁襄";
    var simplifiedChinesePunctuationDB = "，，，，，，、、；。。。。！！……？？**%@";
    var traditionalChineseCharacterDB = "的一是在不了有和人這中大為上個國我以要他時來用們生到作地於出就分對成會可主發年動同工也能下過子說產種面而方後多定行學法所民得經十三之進著等部度家電力裏如水化高自二理起小物現實加量都兩體制機當使點從業本去把性好應開它合還因由其些然前外天政四日那社義事平形相全表間樣與關各重新線內數正心反你明看原又麼利比或但質氣第向道命此變條只沒結解問意建月公無系軍很情者最立代想已通並提直題黨程展五果料象員革位入常文總次品式活設及管特件長求老頭基資邊流路級少圖山統接知較長將組見計別她手角期根論運農指幾九區強放決西被幹做必戰先回則任取據處隊南給色光門即保治北造百規熱領七海地口東導器壓志世金增爭濟階油思術極交受聯什認六共權收證改清已美再采轉更單風切打白教速花帶安場身車例真務具萬每目至達走積示議聲報鬥完類八離華名確才科張信馬節話米整空元況今集溫傳土許步群廣石記需段研界拉林律叫且究觀越織裝影算低持音眾書布複容兒須際商非驗連斷深難近礦千周委素技備半辦青省列習響約支般史感勞便團往酸曆市克何除消構府稱太准精值號率族維劃選標寫存候毛親快效斯院查江型眼王按格養易置派層片始卻專狀育廠京識適屬圓包火住調滿縣局照參紅細引聽該鐵價嚴首底液官德調隨病蘇失爾死講配女黃推顯談罪神藝呢席含企望密批營項防舉球英氧勢告李臺落木幫輪破亞師圍注遠字材排供河態封另施減樹溶怎止案言士均武固葉魚波視僅費緊愛左章早朝害續輕服試食充兵源判護司足某練差致板田降黑犯負擊範繼興似餘堅曲輸修的故城夫夠送筆船占右財吃富春職覺漢畫功巴跟雖雜飛檢吸助升陽互初創抗考投壞策古徑換未跑留鋼曾端責站簡述錢副盡帝射草沖承獨令限阿宣環雙請超微讓控州良軸找否紀益依優頂礎載倒房突坐粉敵略客袁冷勝絕析塊劑測絲協重訴念陳仍羅鹽友洋錯苦夜刑移頻逐靠混母短皮終聚汽村雲哪既距衛停烈央察燒行迅境若印洲刻括激孔搞甚室待核校散侵吧甲遊久菜味舊模湖貨損預阻毫普穩乙媽植息擴銀語揮酒守拿序紙醫缺雨嗎針劉啊急唱誤訓願審附獲茶鮮糧斤孩脫硫肥善龍演父漸血歡械掌歌沙著剛攻謂盾討晚粒亂燃矛乎殺藥寧魯貴鐘煤讀班伯香介迫句豐培握蘭擔弦蛋沉假穿執答樂誰順煙縮征臉喜松腳困異免背星福買染井概慢怕磁倍祖皇促靜補評翻肉踐尼衣寬揚棉希傷操垂秋宜氫套筆督振架亮末憲慶編牛觸映雷銷詩座居抓裂胞呼娘景威綠晶厚盟衡雞孫延危膠還屋鄉臨陸顧掉呀燈歲措束耐劇玉趙跳哥季課凱胡額款紹卷齊偉蒸殖永宗苗川爐岩弱零楊奏沿露杆探滑鎮飯濃航懷趕庫奪伊靈稅了途滅賽歸召鼓播盤裁險康唯錄菌純借糖蓋橫符私努堂域槍潤幅哈竟熟蟲澤腦壤碳歐遍側寨敢徹慮斜薄庭都納彈飼伸折麥濕暗荷瓦塞床築惡戶訪塔奇透梁刀旋跡卡氯遇份毒泥退洗擺灰彩賣耗夏擇忙銅獻硬予繁圈雪函亦抽篇陣陰丁尺追堆雄迎泛爸樓避謀噸野豬旗累偏典館索秦脂潮爺豆忽托驚塑遺愈朱替纖粗傾尚痛楚謝奮購磨君池旁碎骨監捕弟暴割貫殊釋詞亡壁頓寶午塵聞揭炮殘冬橋婦警綜招吳付浮遭徐您搖穀贊箱隔訂男吹樂園紛唐敗宋玻巨耕坦榮閉灣鍵凡駐鍋救恩剝凝堿齒截煉麻紡禁廢盛版緩淨睛昌婚涉筒嘴插岸朗莊街藏姑貿腐奴啦慣乘夥恢勻紗紮辯耳彪臣億璃抵脈秀薩俄網舞店噴縱寸汗掛洪著賀閃柬爆烯津稻牆軟勇像滾厘蒙芳肯坡柱蕩腿儀旅尾軋冰貢登黎削鑽勒逃障氨郭峰幣港伏軌畝畢擦莫刺浪秘援株健售股島甘泡睡童鑄湯閥休匯舍牧繞炸哲磷績朋淡尖啟陷柴呈徒顏淚稍忘泵藍拖洞授鏡辛壯鋒貧虛彎摩泰幼廷尊窗綱弄隸疑氏宮姐震瑞怪尤琴循描膜違夾腰緣珠窮森枝竹溝催繩憶邦剩幸漿欄擁牙貯禮濾鈉紋彈罷拍咱喊袖埃勤罰焦潛伍墨欲縫姓刊飽仿獎鋁鬼麗跨默挖鏈掃喝袋炭汙幕諸弧勵梅奶潔災舟鑒苯訟抱毀率懂寒智埔寄屆躍渡挑丹艱貝碰拔爹戴碼夢芽熔赤漁哭敬顆奔藏鉛熟仲虎稀妹乏珍申桌遵允隆螺倉魏銳曉氮兼隱礙赫撥忠肅缸牽搶博巧殼兄杜訊誠碧祥柯頁巡矩悲灌齡倫票尋桂鋪聖恐恰鄭趣抬荒騰貼柔滴猛闊輛妻填撤儲簽鬧擾紫砂遞戲吊陶伐喂療瓶婆撫臂摸忍蝦蠟鄰胸鞏擠偶棄槽勁乳鄧吉仁爛磚租烏艦伴瓜淺丙暫燥橡柳迷暖牌纖秧膽詳簧踏瓷譜呆賓糊洛輝憤競隙怒粘乃緒肩籍敏塗熙皆偵懸掘享糾醒狂鎖澱恨牲霸爬賞逆玩陵祝秒浙貌役彼悉鴨著趨鳳晨畜輩秩卵署梯炎灘棋驅篩峽冒啥壽譯浸泉帽遲矽疆貸漏稿冠嫩脅芯牢叛蝕奧鳴嶺羊憑串塘繪酵融盆錫廟籌凍輔攝襲筋拒僚旱鉀鳥漆沈眉疏添棒穗硝韓逼扭僑涼挺碗栽炒杯患餾勸豪遼勃鴻旦吏拜狗埋輥掩飲搬罵辭勾扣估蔣絨霧丈朵姆擬宇輯陝雕償蓄崇剪倡廳咬駛薯刷斥番賦奉佛澆漫曼扇鈣桃扶仔返俗虧腔鞋棱覆框悄叔撞騙勘旺沸孤粘吐孟渠屈疾妙惜仰狠脹諧拋黴桑崗嘛衰盜滲髒賴湧甜曹閱肌哩厲烴緯毅昨偽症煮歎釘搭莖籠酷偷弓錐恒傑坑鼻翼綸敘獄逮罐絡棚抑膨蔬寺驟穆冶枯冊屍凸紳坯犧焰轟欣晉瘦禦錠錦喪旬鍛壟搜佛撲邀亭酯邁舒脆酶閑憂酚頑羽漲卸仗陪薄辟懲杭姚肚捉飄漂昆欺吾郎烷汁呵飾蕭雅郵遷燕撒姻赴宴煩削債帳斑鈴旨醇董餅雛姿拌傅腹妥揉賢拆歪葡胺丟浩徽昂墊擋覽貪慰繳汪慌馮諾薑誼凶劣誣耀昏躺盈騎喬溪叢盧抹易悶咨刮駕纜悟摘鉺擲頗幻柄惠慘佳仇臘窩滌劍瞧堡潑蔥罩霍撈胎蒼濱倆捅湘砍霞邵萄瘋淮遂熊糞烘宿檔戈駁嫂裕徙箭捐腸撐曬辨殿蓮攤攪醬屏疫哀蔡堵沫皺暢疊閣萊敲轄鉤痕壩巷餓禍丘玄溜曰邏彭嘗卿妨艇吞韋怨矮歇郊祿撚漠粹顛宏冤肪饑呵仙押挨醛娃拾沒佩勿嚇訛侯戀夕鋅篡戚淋蓬豈釉兆泊魂拘亡杠摧氟頌渾淩鈾誘犁譴頒舶扯嘉萌猶滋焊舌匹媳肺掠釀烹疲馳鴉窄辱狹樸遣菲奸韌辣拳稈臥醉竭茅墓矣哎豔敦輿締雇尿葬履契禽渣襯躲賠鹹溉賊醋堤抖妃褲廉晴挽掀茫醜亥攔悠闡慧佐奇豎孝櫃麟繡遙逝愁肖昭芬逢窯捷圜盲閘宙輻披賬狼幽綢蜂慎餐酬誓惟叉彌址幟芝砌唉僕濤臭翠盒劫慨炳闔寂椒倘拓畏喉巾頸墾拚獸蔽蘆乾爽竊譚掙崩模褐傳翅儒傘晃謬胚剖湊眠濁霜礁蔑抄闖灑碑蓉耶猜蹲壺喚澳鋸郡玲綿紐梳掏籲錘鼠穴椅殷遮吵萍厭畜俱誇呂囊捧雌閩饒瞬鬱哨鑿朝俺滸茂肝勳盯籽恥菊濫稼戒奈帥鞭蠶鎂詢跌烤壇宅笛鄂蠻顫棍睜鼎岌降侍藩嚷匪嶽糟纏迪泄卑氛堪蘿盛碘縛悅澄甫攀屠溢拱晰攜朽吟菱謙凹俊芒盼嬸艘醯趁唇挫羞浴疼萎肴愚腫刨絞樞嫁慕艙鏟蘋豫諭迭潘頃翁榜匠欠茬疇胃沾蹤弊哼鵬歧桐沃悼惑潰蔗薦潭孢露診庸聰嫌廚龐祁鉗肆梭贈崖籃穎甸藻搗且撕詔貞賜慈炕胖茲差瓊鏽汛卓棵饋撓灶嬰蒂膚衫瀝侖勉滬逸蜜浦嗓暈膏祭贏艾扮鵝憐蒲兔孕嚦蘖挪淑謠懼廊緬俘驕膀陡宰誕峻惱腺獵渦夷愉魔銨葛賈似蔭喲脊鈔苛錳橢鑲杏溴倚滯會氓捏斬傲匆僵鹵燙衍榨攏裸屑咽坊舅渴翔邪拄窖貓砌欽媒脾勺柏柵噪晝耿扁辰秤得販糕梁曇衷宦扔哇詐囑藤蔔岡悔廓皂拐氰杉瑪矢寓瓣罕垮筍淘銜稱恭喇帕桉秉簾銘蛇摔齋叭帆裸儉瘤篷砸肢辟脖瞪暑蔔竿殲笙酮蘊嘩瞎喀刃楔喘枚嵌撾廂粵甩拴膝懇腕娓熄錨忌愧哦荊圃騷丸蒜毯弗俯鹿梢屯衙轎賤壘諒踢啞滔渥餉泳棕熬擱腈梨吻櫻奠捆姨柏聘惕鄆綁冀裹酥寡彥稠啡鈍汝擅汰鱅埔敞嘿遜棟謹咖鯉雀傭庵葫賄鱗拼搏謊塌忉膩戊怖墳禾刹嘻桔坎拇煽獅癢曾梗寇鷹燭哄莽雯胳龜亟糠泌坪傻什喻淵蚌跪巷涅釗譬蕊膛侮奕枕辮況扼郝寥淒廈腥鈞耦蹄戥屁誦匈樁釣涵倦袍抒嶼蹈忿敷虹聊嗣尉燦糙蹬嗯姬狡笨辜僧茨諷翰枉岐棗嶄焚咕猴攬澇耍趟洶咋傍鍍給爵虜劈璋踩瞅迄昔汞呱詭魄祺嘲惶贓癌咐歉扳鄙廬聶便芡軀貶煌擰隋襄淤寵炊滇謇懶栓佑憾駱裙猖兜孵痼盥曝泣絮韻眷曠噢參棲盞鼇濺煎校榴暮琪淆陛巢噠吼槐唧其沛乞蜀蜇賺捍鉸冪堯咒耽叮褂煥煞雹搓釜鉻揀募淹瑰鰱茄灼鄒躬覺嬌焉彰鶴琳淪畔惹庶斃皖邢禹漬繃竄翹淫簞陌膊韃咳玫巫拂蕉瀾贖綏鋤囪賭頰縷寅躁稚庚苟氦魁珊蛻蛭酌逗閨蔓撇豌朕緝襟鎳桅熒侄卒佃瞿娶飪聳乍靶癡靖扛筐韶囂崔蓿岔氘娥剿霖喃搪雍裳撰豹駿慷";

    var characterDB = null;
    var punctuationDB = simplifiedChinesePunctuationDB;
    if (textType === "simplified-Chinese") {
        characterDB = simplifiedChineseCharacterDB;
    } else {
        characterDB = traditionalChineseCharacterDB;
    }
    var characters = "";
    // 选项为纯文本时
    if (textStyle === "plain-radom-text") {
        characters = getPlainCharacters(textSize, characterDB);
    } else {
        // 选项为带标点的文本时
        characters = getCharatersWithPuntuation(textSize, characterDB, punctuationDB);
    }

    // 输出最终文本结果
    var generatedRadomText = document.getElementsByClassName("generated-radom-text")[0];
    generatedRadomText.innerHTML = characters;
}

// 根据得到的文本字数返回相应的随机纯文本
function getPlainCharacters(textSize, characterDB) {
    var textLength = characterDB.length;
    if (textSize > textLength || textSize <= 0) {
        console.log("请输入正确值！");
        return;
    }
    var plainCharacters = "";
    for (let i = 0; i < textSize; i++) {
        //var radomLocation = Math.floor(textLength*Math.random());
        plainCharacters += characterDB[getRadomNumber(textLength)];
    }
    console.log(plainCharacters);
    return plainCharacters;
}

// 根据得到的文本字数返回带标点符号的文本
function getCharatersWithPuntuation(textSize, characterDB, punctuationDB) {
    var textLength = characterDB.length;
    if (textSize > textLength || textSize <= 0) {
        console.log("请输入正确值！");
        return;
    }
    var characters = characterDB[getRadomNumber(textLength)];
    for (let i = 1; i < textSize; i++) {
        //var radomLocation = Math.floor(textLength*Math.random());
        if (Math.random() < 0.04) {
            // 前一个字符是标点则后一个字符不为标点
            if (punctuationDB.indexOf(characters[i - 1]) === -1) {
                characters += punctuationDB[getRadomNumber(punctuationDB.length)];
                continue;
            }
        }
        characters += characterDB[getRadomNumber(textLength)];
    }
    //console.log(characters);

    // 当文本最后一个字符非标点符号时为其添加末尾标点
    if (punctuationDB.indexOf(characters[characters.length - 1]) === -1) {
        //console.log(characters[characters.length-1]);
        var endPunctuatoins = ["。", "！", "？"];
        characters += endPunctuatoins[getRadomNumber(endPunctuatoins.length)];

    }
    // 添加换行
    characters = "<p>" + characters + "</p>";
    characters = characters.replace(/\*/g, "。</p><p>").replace(/\%/g, "！</p><p>").replace(/\@/g, "？</p><p>");

    return characters;
}
window.onload = function () {
    var generateBtn = document.getElementsByClassName("generate-btn")[0];
    bindEventWithSafty("click", generateBtn, getRadomTextParameters);
    isCustomerizedTextSize();
};